# Repositories where Homebrew keeps is own software
tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/git"   # Git
tap "nikitabobko/tap" # AeroSpace

# Tools to use in the shell

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Structural diff tool that understands syntax.
brew "difftastic"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Privacy Guard - a complete and free implementation of the OpenPGP standard
brew "gnupg"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Standalone applications

# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Application launcher and productivity software
cask "alfred"
# URL handler
cask "choosy"
# Write, edit, and chat about your code with AI
cask "cursor"
# Redirect browser requests to different apps
cask "finicky"
# Fonts
cask "font-meslo-lg-nerd-font"
# Google Chrome
cask "google-chrome"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Notion
cask "notion"
# Spotify
cask "spotify"
# Telegram
cask "telegram"
# WhatsApp client
cask "whatsapp"
# Zen Browser - Firefox fork
cask "zen-browser"
