# Repositories where Homebrew keeps is own software
# tap "homebrew/bundle" # Deprecated
# tap "homebrew/services" # Deprecated
# tap "microsoft/git"   # Git
tap "nikitabobko/tap" # AeroSpace
tap "zackriya-solutions/meetily" # Meetily

# Tools to use in the shell

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Structural diff tool that understands syntax.
brew "difftastic"
# GitHub CLI
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# AST-based pattern checker for JavaScript
brew "eslint"
# Speed up eslint to accelerate your development workflow
brew "eslint_d"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Compiler Collection
brew "gcc"
# GNU Privacy Guard - a complete and free implementation of the OpenPGP standard
brew "gnupg"
# Distributed revision control system
brew "git"
# Utility for directing compilation
brew "make"
# Mise is a polyglot tool version manager. It replaces tools like asdf, nvm, pyenv, rbenv, etc.
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Bun is a fast, modern JavaScript runtime
# brew "oven-sh/bun/bun"
# Theme for zsh
brew "powerlevel10k"
# Faster Prettier for JavaScript, TypeScript, CSS, etc. than vanilla prettier
brew "prettierd"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Vi-mode for zsh
# brew "zsh-vi-mode"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# CSV editor
brew "csvkit"

# Standalone applications

# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Application launcher and productivity software
cask "alfred"
# Git Credential Manager for macOS and Linux
cask "git-credential-manager"
# Write, edit, and chat about your code with AI
cask "cursor"
# OpenAI's coding agent for the terminal (Codex CLI)
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# AI meeting assistant with local transcription support
cask "meetily"
# Redirect browser requests to different apps
cask "finicky"
# Fonts
cask "font-meslo-lg-nerd-font"
# Google Chrome
cask "google-chrome"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Notion
# cask "notion"
# Obsidian
cask "obsidian"
# Slack
cask "slack"
# Spotify
cask "spotify"
# Telegram
cask "telegram"
# WhatsApp client
cask "whatsapp"
# Zen Browser - Firefox fork
cask "zen-browser"
