anthropic.claude-code@2.1.33
apollographql.vscode-apollo@2.6.5
astro-build.astro-vscode@2.16.8
atlassian.atlascode@4.0.19
austenc.tailwind-docs@2.1.0
bmewburn.vscode-intelephense-client@1.16.5
bradlc.vscode-tailwindcss@0.14.28
bung87.rails@0.22.0
bung87.vscode-gemfile@0.4.2
chaxwell.twig-link-resolver@1.0.6
christian-kohler.npm-intellisense@1.4.5
christian-kohler.path-intellisense@2.10.0
cipchk.cssrem@4.1.1
davidanson.vscode-markdownlint@0.61.1
dbaeumer.vscode-eslint@3.0.20
eamodio.gitlens@17.9.0
editorconfig.editorconfig@0.17.4
esbenp.prettier-vscode@12.3.0
figma.figma-vscode-extension@0.4.1
formulahendry.auto-rename-tag@0.1.10
github.vscode-github-actions@0.29.1
github.vscode-pull-request-github@0.120.2
golang.go@0.52.1
graphql.vscode-graphql-execution@0.3.2
graphql.vscode-graphql-syntax@1.3.8
graphql.vscode-graphql@0.13.2
henoc.svgeditor@2.9.0
heybourn.headwind@2.0.0
htmlhint.vscode-htmlhint@1.15.1
humao.rest-client@0.26.0
jock.svg@1.5.4
mattpocock.ts-error-translator@0.10.1
maxvanderschee.web-accessibility@0.2.83
mblode.twig-language-2@0.9.4
mcright.auto-save@1.0.3
meganrogge.template-string-converter@0.6.1
mikestead.dotenv@1.0.1
moalamri.inline-fold@0.2.6
ms-playwright.playwright@1.1.17
ms-vsliveshare.vsliveshare-pack@0.4.0
ms-vsliveshare.vsliveshare@1.0.5948
nidu.copy-json-path@0.4.0
nucllear.vscode-extension-auto-import@1.4.3
orta.vscode-jest@6.4.4
pkief.material-icon-theme@5.31.0
postman.postman-for-vscode@1.19.1
pranaygp.vscode-css-peek@4.4.3
rebornix.ruby@0.28.1
redhat.vscode-yaml@1.19.1
ritwickdey.liveserver@5.7.9
rokoroku.vscode-theme-darcula@1.2.3
rust-lang.rust-analyzer@0.3.2777
shopify.ruby-lsp@0.10.0
sianglim.slim@0.1.3
silvenon.mdx@0.1.1
steoates.autoimport@1.5.4
streetsidesoftware.code-spell-checker@4.4.0
sumneko.lua@3.17.1
svelte.svelte-vscode@109.13.0
tamasfe.even-better-toml@0.21.2
tamj0rd2.ts-quickfixes-extension@1.15.0
testdouble.vscode-standard-ruby@0.0.16
tyriar.sort-lines@1.12.0
unifiedjs.vscode-mdx@1.8.17
vadistic.mdx-inline@0.1.0
vintharas.learn-vim@0.0.28
visualstudioexptteam.intellicode-api-usage-examples@0.2.9
visualstudioexptteam.vscodeintellicode@1.3.2
vscodevim.vim@1.32.4
wayou.vscode-todo-highlight@1.0.5
whatwedo.twig@1.0.2
wingrunr21.vscode-ruby@0.28.0
wix.glean@5.2.2
wix.vscode-import-cost@3.3.0
yzhang.markdown-all-in-one@3.6.3
